diplom-src/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ВКМ_МассовоеСозданиеАктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_МассовоеСозданиеАктов</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДокументыЗаПериод</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументРеализация</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

diplom-src/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

diplom-src/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

diplom-src/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ПериодДействияДоговора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаАбонентскойПлаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

diplom-src/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ObjectModule.bsl
Функция ЗаполнитьНаСервере(Параметры, АдресРезультата) Экспорт 
	
	НачалоПериода = НачалоМесяца(Дата(Параметры.Период));
	КонецПериода = КонецМесяца(Дата(Параметры.Период));
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
					"ВЫБРАТЬ
					|	ДоговорыКонтрагентов.Ссылка КАК Договор
					|ПОМЕСТИТЬ втДоговоры
					|ИЗ
					|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
					|ГДЕ
					|	ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора
					|	И &ДатаЗапроса МЕЖДУ ДоговорыКонтрагентов.ВКМ_ДатаНачалаДействияДоговора И ДоговорыКонтрагентов.ВКМ_ДатаОкончанияДействияДоговора
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	РеализацияТоваровУслуг.Договор.Ссылка КАК Реализации
					|ПОМЕСТИТЬ втРеализации
					|ИЗ
					|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
					|ГДЕ
					|	РеализацияТоваровУслуг.Договор.ВидДоговора = &ВидДоговора
					|	И РеализацияТоваровУслуг.Дата МЕЖДУ &НачалоПериода И &КонецПериода
					|	И РеализацияТоваровУслуг.ПометкаУдаления = ЛОЖЬ
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	втДоговоры.Договор.Ссылка КАК ДоговорСсылка
					|ИЗ
					|	втДоговоры КАК втДоговоры
					|		ЛЕВОЕ СОЕДИНЕНИЕ втРеализации КАК втРеализации
					|		ПО (втРеализации.Реализации.Ссылка = втДоговоры.Договор.Ссылка)
					|ГДЕ
					|	втРеализации.Реализации.Ссылка ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("ВидДоговора", ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание"));
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Запрос.УстановитьПараметр("ДатаЗапроса", НачалоПериода);
	
	Выборка = Запрос.Выполнить().Выгрузить();
	
	ВсегоДокументов = Выборка.Количество();
	ТекДок = 0;
	
	Если НЕ Запрос.Выполнить().Пустой() Тогда
	
			Для каждого ЭлементВыборка Из Выборка Цикл
				
				НовыйДокумент = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
				НовыйДокумент.Контрагент = ЭлементВыборка.ДоговорСсылка.Владелец;
				НовыйДокумент.Договор = ЭлементВыборка.ДоговорСсылка.Ссылка;
				НовыйДокумент.Организация = ЭлементВыборка.ДоговорСсылка.Организация;
				НовыйДокумент.Ответственный = ПараметрыСеанса.ТекущийПользователь;
				НовыйДокумент.Дата = КонецПериода;
				НовыйДокумент.ВыполнитьАвтозаполнение();
				
				Если ЗначениеЗаполнено(НовыйДокумент.Услуги) Тогда
					
					НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Неоперативный);
					//тчДокументы = Параметры.Объект.ДокументыЗаПериод.Добавить();
					//тчДокументы.Договор = НовыйДокумент.Договор.Ссылка;
					//тчДокументы.ДокументРеализация = НовыйДокумент.Ссылка;
					
				Иначе 
					Клиент = НовыйДокумент.Контрагент;
					Договор = НовыйДокумент.Договор;
					ТекстСообщения = СтрШаблон("Клиенту %1 по договору %2 за %3 услуг не предоставлялось",
					Клиент, Договор, Формат(КонецПериода, "ДФ='MMMM yyyy'"));
					
					Возврат ТекстСообщения;
					
				КонецЕсли;
				
				ПроцентВыполнения = (ТекДок/ВсегоДокументов)*100;
				ПроцентВыполнения = Окр(ПроцентВыполнения,0);
				
				//МассивВозврат.Добавить(ПроцентВыполнения);
				
				// сообщаем "процент" и "текст сообщения"
				ДлительныеОперации.СообщитьПрогресс(ПроцентВыполнения);
				
				ТекДок = ТекДок + 1;
				
				
			КонецЦикла;
			
			ТекстСообщения = "Создано" + ВсегоДокументов + "документов";
			Возврат ТекстСообщения;
		
	Иначе
		
		ТекстСообщения = "За указанный период документы уже созданы";
		Возврат ТекстСообщения;
		
	КонецЕсли;
	
КонецФункции
